/**
 * Пакет содержит классы:
 * Square - создаёт массив чисел, возведённых в квадрат, от 1 до n.
 * FindLoop - ищет элемент в массиве методом простого перебора.
 * Turn - выполняет перестановку элементов массива для получения обратной последовательности.
 * Check - выполняет проверку элементов массива на одинаковость.
 * ArrayChar - Определяет вхождение префикса в строку.
 * BubbleSort - Сортировка массива методом пузырька.
 * Matrix - Двумерный массив - таблица умножения.
 * */
package ru.job4j.array;