/**
 * Классы:
 *
 * BishopWhite - "Белый Слон" хранит свою позицию и определяет, как "ходит" эта фигура.
 * KingWhite - "Белый Король" хранит свою позицию и определяет, как "ходит" эта фигура.
 * KnightWhite - "Белый Конь" хранит свою позицию и определяет, как "ходит" эта фигура.
 * PawnWhite - "Белая Пешка" хранит свою позицию и определяет, как "ходит" эта фигура.
 * QueenWhite - "Белый Ферзь" хранит свою позицию и определяет, как "ходит" эта фигура.
 * RookWhite - "Белая Ладья" хранит свою позицию и определяет, как "ходит" эта фигура.
 * */
package ru.job4j.chess.firuges.white;