/**
 * Классы:
 *
 * BishopBlack - "Чёрный Слон" хранит свою позицию и определяет, как "ходит" эта фигура.
 * KingBlack - "Чёрный Король" хранит свою позицию и определяет, как "ходит" эта фигура.
 * KnightBlack - "Чёрный Конь" хранит свою позицию и определяет, как "ходит" эта фигура.
 * PawnBlack - "Чёрная Пешка" хранит свою позицию и определяет, как "ходит" эта фигура.
 * QueenBlack - "Чёрный Ферзь" хранит свою позицию и определяет, как "ходит" эта фигура.
 * RookBlack - "Чёрная Ладья" хранит свою позицию и определяет, как "ходит" эта фигура.
 * */
package ru.job4j.chess.firuges.black;